chengping1970/STM8S207/sw_i2c.c
/*SW_I2C.C file
 */
#include <stdio.h>
#include "stm8s.h"
#include "stm8s_gpio.h"
#include "stm8s_exti.h"
#include "stm8s_tim1.h"
#include "stm8s_flash.h"
#include "ir.h" 
#include "uart.h"
#include "sw_i2c.h"
#include "it680x.h"
#include "Mhlrx.h"
#include "Mhlrx_reg.h"

#define IIC_PORT				GPIOB
#define IIC_SCL0_PIN			GPIO_PIN_4
#define IIC_SDA0_PIN			GPIO_PIN_5
#define IIC_SCL1_PIN			GPIO_PIN_2
#define IIC_SDA1_PIN			GPIO_PIN_3

#define FPGA_RESET_PORT			GPIOC
#define FPGA_RESET_PIN			GPIO_PIN_4
#define IT680X_RESET_PORT		GPIOB
#define IT680X_RESET_PIN		GPIO_PIN_0

#define POWER_ONOFF_PORT		GPIOE
#define POWER_ONOFF_PIN			GPIO_PIN_2
#define POWER_ONOFF1_PIN		GPIO_PIN_3

#define BACKLIGHT_ONOFF_PORT	GPIOE
#define BACKLIGHT_ONOFF_PIN		GPIO_PIN_1
#define BACKLIGHT_ONOFF1_PORT	GPIOD
#define BACKLIGHT_ONOFF1_PIN	GPIO_PIN_0

#define VPANEL_ONOFF_PORT		GPIOE
#define VPANEL_ONOFF_PIN		GPIO_PIN_0

#define BACKLIGHT_PWM_PORT		GPIOC
#define BACKLIGHT_PWM_PIN		GPIO_PIN_1

#define LED_G_PORT				GPIOD
#define LED_G_PIN				GPIO_PIN_4
#define LED_R_PORT				GPIOD
#define LED_R_PIN				GPIO_PIN_3

#define HDMI0_HOTPLUG_PORT		GPIOC
#define HDMI0_HOTPLUG_PIN		GPIO_PIN_2
#define HDMI1_HOTPLUG_PORT		GPIOC
#define HDMI1_HOTPLUG_PIN		GPIO_PIN_3

#define FPGA_ADDRESS			0xBA
#define FRC_BOARD_ADDRESS		0x22

#define FRC_UPDATE_TIME			(500 + 1)
#define SECRET_DETECT_TIME		(500 + 1)
#define SINGNAL_TETECT_TIME		(150 + 1) 
#define BACKLIGHT_DELAY_TIME	(5000 + 1)
#define PANEL_UPDATE_TIME		(1000 + 1)

#define SIGNAL_STABLE_COUNT		5
#define NO_SIGNAL_COUNT			2
#define IIC_ACK_TIMEOUT			50

#define SET_POWER_ON()			GPIO_WriteLow(POWER_ONOFF_PORT, POWER_ONOFF_PIN|POWER_ONOFF1_PIN)
#define SET_POWER_OFF()			GPIO_WriteHigh(POWER_ONOFF_PORT, POWER_ONOFF_PIN|POWER_ONOFF1_PIN)
#define SET_VPANEL_ON()			GPIO_WriteHigh(VPANEL_ONOFF_PORT, VPANEL_ONOFF_PIN)
#define SET_VPANEL_OFF()		GPIO_WriteLow(VPANEL_ONOFF_PORT, VPANEL_ONOFF_PIN)
#define SET_BACKLIGHT_ON()		{GPIO_WriteLow(BACKLIGHT_ONOFF_PORT, BACKLIGHT_ONOFF_PIN);GPIO_WriteLow(BACKLIGHT_ONOFF1_PORT, BACKLIGHT_ONOFF1_PIN);}
#define SET_BACKLIGHT_OFF()		{GPIO_WriteHigh(BACKLIGHT_ONOFF_PORT, BACKLIGHT_ONOFF_PIN);GPIO_WriteHigh(BACKLIGHT_ONOFF1_PORT, BACKLIGHT_ONOFF1_PIN);}

static const GPIO_Pin_TypeDef IIC_SDA_pin[2] = {IIC_SDA0_PIN, IIC_SDA1_PIN};
static const GPIO_Pin_TypeDef IIC_SCL_pin[2] = {IIC_SCL0_PIN, IIC_SCL1_PIN};
static u8 IIC_bus_no = 0;
static u32 Backlight_on_timer = TIMER_STOPPED;
#if FPGA_KEY_VERIFY_AUTO
static u32 secret_detect_timer = TIMER_EXPIRED;
#endif
u8 Power_status = FALSE;
u8 I2C_stop = FALSE;
u8 Set3DOn = FALSE;
static u8 I2C_write_EE = FALSE;
static u32 signal_detect_timer	= TIMER_EXPIRED;
static u8 signal_status, singal_change_count;
#if CONTROL_FRC_BOARD
static u8 Have_FRC;
static u8 LVDS_mode = 0;
static u32 frc_update_timer = TIMER_EXPIRED;
#endif
#if WRITE_4K30Hz_PANEL
static u32 panel_update_timer = TIMER_EXPIRED;
#endif

#if MHL_IIC_ERROR_RESET
static u8 I2C_error_count = 0;
#endif
#if FPGA_KEY_VERIFY
static const u8 secret_key_table1[] =
{
	0x02, 0xa1, 0x7e, 0x7d, 0x1e, 0x1a, 0x2b, 0x24, 0xa4, 0x3c, 0xa0, 0x6e, 0x23, 0xa9, 0xbf, 0x5d,
	0x4d, 0x4f, 0xac, 0xa5, 0xf7, 0x04, 0x2a, 0xe4, 0x64, 0xa2, 0xec, 0xfd, 0x53, 0x4a, 0x5c, 0xc5,
	0xbb, 0x6a, 0xdc, 0x03, 0xe5, 0xca, 0xbd, 0x2d, 0x0b, 0xd5, 0x29, 0xbc, 0xb0, 0x34, 0x9a, 0xc3,
	0xa7, 0xf3, 0x61, 0x70, 0x95, 0xda, 0x33, 0x21, 0x45, 0xba, 0x2e, 0x9d, 0x67, 0x5a, 0x9c, 0x48,
	0x8f, 0x0f, 0x6c, 0xe9, 0xde, 0x1c, 0xc8, 0xe8, 0x1b, 0xdb, 0x5e, 0x54, 0x58, 0x68, 0xe2, 0x81,
	0x8b, 0x79, 0x22, 0x32, 0xf0, 0xc2, 0x7f, 0xdf, 0x25, 0x75, 0x97, 0x1d, 0x18, 0x38, 0x44, 0x8e,
	0x94, 0x57, 0x63, 0x56, 0x90, 0xe0, 0xfa, 0xb7, 0x12, 0x41, 0x84, 0xe1, 0x26, 0xe3, 0x1f, 0x8a,
	0x92, 0x30, 0xfb, 0x9e, 0xd9, 0x8c, 0x99, 0x7c, 0x96, 0x5f, 0x77, 0xa3, 0x46, 0x06, 0x6d, 0xd2,
	0xb8, 0x4c, 0x83, 0x72, 0x3d, 0x59, 0xd1, 0x6b, 0xab, 0xb3, 0xd8, 0x40, 0x6f, 0x3f, 0x3b, 0xc6,
	0xff, 0xc0, 0x98, 0xcb, 0x28, 0x31, 0x05, 0x88, 0xbe, 0xf4, 0xc4, 0xb5, 0x89, 0x55, 0x0e, 0x14,
	0x15, 0x17, 0xad, 0x71, 0x7b, 0xcc, 0xc1, 0xc9, 0x00, 0xd3, 0xea, 0x51, 0xb4, 0x35, 0xb2, 0x3e,
	0x47, 0x08, 0x73, 0x20, 0xb1, 0x4e, 0x60, 0xb9, 0x0d, 0xfe, 0x76, 0x37, 0x0c, 0xd7, 0xf9, 0x50,
	0x5b, 0x01, 0x8d, 0x78, 0xce, 0xae, 0xe6, 0x4b, 0xf5, 0xcd, 0x09, 0xc7, 0xf6, 0x52, 0x9b, 0xfc,
	0x62, 0x85, 0x11, 0x74, 0x49, 0x93, 0x66, 0x16, 0xa8, 0x43, 0x19, 0x9f, 0x27, 0xeb, 0x13, 0x3a,
	0xe7, 0x65, 0x82, 0x36, 0x39, 0xdd, 0x87, 0x86, 0x0a, 0xb6, 0xd6, 0xaf, 0x69, 0x2f, 0x42, 0x10,
	0x91, 0xf2, 0x2c, 0xd0, 0x7a, 0xd4, 0xee, 0x80, 0x07, 0xa6, 0xf8, 0xf1, 0xef, 0xcf, 0xaa, 0xed
};

static const u8 secret_key_table2[] =
{
	0xec, 0x7c, 0x5a, 0xda, 0x42, 0xbd, 0xa1, 0x23, 0xc8, 0xd9, 0x26, 0xee, 0x8e, 0x80, 0xe1, 0x0f,
	0x4f, 0x4b, 0x5c, 0x49, 0xbc, 0xdc, 0x06, 0x0d, 0xd2, 0xbe, 0x50, 0x7a, 0x94, 0xed, 0x08, 0x2b,
	0x17, 0x2e, 0xe9, 0xe6, 0x6f, 0x43, 0xc2, 0x74, 0x83, 0xa2, 0x97, 0xa4, 0xf0, 0x36, 0xb5, 0x44,
	0x58, 0x90, 0x5e, 0xbf, 0x84, 0xc6, 0x27, 0x3d, 0x20, 0x12, 0x60, 0x55, 0xd8, 0x62, 0xf6, 0x21,
	0x16, 0x73, 0x79, 0x5b, 0x93, 0x92, 0x69, 0x37, 0x09, 0x04, 0xb8, 0x57, 0x33, 0x39, 0x99, 0x88,
	0x7f, 0xf5, 0x7e, 0x6a, 0x4a, 0x22, 0x91, 0x40, 0xa8, 0xad, 0xb6, 0xd4, 0x24, 0x7b, 0x0c, 0xb1,
	0x45, 0x9d, 0x13, 0xc0, 0x51, 0x5d, 0xba, 0x9e, 0x41, 0x2f, 0x01, 0xae, 0x9b, 0xb0, 0x8f, 0xd7,
	0x1e, 0xb4, 0x8a, 0xd5, 0xdf, 0x8d, 0x63, 0xa0, 0x18, 0xe3, 0x56, 0x1d, 0x86, 0x25, 0x48, 0xf9,
	0x87, 0xa6, 0x1c, 0x67, 0x65, 0x70, 0xab, 0x35, 0xeb, 0xe2, 0x2a, 0x9a, 0xca, 0xcf, 0xd6, 0xa7,
	0x5f, 0x31, 0x53, 0x59, 0xd1, 0x3e, 0xcb, 0xcc, 0x8b, 0xe7, 0xb3, 0x1f, 0x81, 0xe0, 0x77, 0x0b,
	0xde, 0xf1, 0xa9, 0x52, 0xc1, 0xc4, 0x3f, 0x10, 0x3a, 0x4e, 0xc5, 0x6b, 0xb2, 0xa3, 0xcd, 0x98,
	0xe8, 0x96, 0x71, 0x15, 0x6e, 0x00, 0xf7, 0x29, 0x61, 0x3c, 0xd0, 0x3b, 0xdb, 0xfa, 0x0a, 0xb9,
	0x9c, 0x32, 0xfe, 0x6d, 0x68, 0xc9, 0xe5, 0x1b, 0x66, 0x30, 0xd3, 0xac, 0x82, 0xbb, 0xfb, 0x19,
	0x03, 0xef, 0xce, 0xfc, 0x46, 0x4d, 0x0e, 0x76, 0x14, 0x1a, 0x2d, 0x89, 0x05, 0x72, 0x07, 0x11,
	0xe4, 0x02, 0x54, 0xf4, 0xfd, 0x75, 0xaa, 0x47, 0xea, 0xf8, 0x7d, 0xc7, 0x6c, 0x28, 0x8c, 0x38,
	0x95, 0xf3, 0xf2, 0x9f, 0xb7, 0x4c, 0x34, 0xc3, 0xff, 0x64, 0xdd, 0x78, 0xaf, 0xa5, 0x2c, 0x85
};

static const u8 secret_key_table3[] =
{
	0x98, 0xe8, 0xb8, 0x63, 0x48, 0x60, 0x70, 0x95, 0xea, 0x23, 0x69, 0x64, 0x74, 0xf0, 0x9c, 0x5f,
	0x6c, 0x08, 0x01, 0xc3, 0x3f, 0x2c, 0x05, 0x1f, 0x0a, 0xd1, 0x66, 0xcf, 0x1a, 0x4a, 0x85, 0x5b,
	0x94, 0x92, 0x67, 0x7c, 0xe5, 0x99, 0x87, 0xec, 0x28, 0xf5, 0x6f, 0x41, 0xd6, 0xeb, 0x86, 0x75,
	0x50, 0xb5, 0x45, 0x21, 0x93, 0x71, 0xac, 0xe3, 0xf9, 0x7d, 0x80, 0x3c, 0x3a, 0xe6, 0x24, 0x5a,
	0x55, 0x5e, 0x0d, 0x68, 0x7f, 0xae, 0x82, 0x0c, 0x18, 0xf3, 0x32, 0xe0, 0x89, 0xd8, 0x34, 0x79,
	0x25, 0xc4, 0x6e, 0x8a, 0x46, 0xba, 0x4f, 0x88, 0xe7, 0x6a, 0x17, 0xf6, 0x20, 0xaf, 0xbc, 0x42,
	0x78, 0xfd, 0x44, 0xb4, 0x40, 0xc9, 0x11, 0x14, 0x5c, 0x0f, 0xbb, 0x06, 0xc0, 0xf2, 0x12, 0x29,
	0x13, 0xc6, 0xf4, 0x09, 0xbd, 0xe1, 0x4e, 0xda, 0x22, 0xe4, 0xb3, 0xdb, 0xa3, 0x5d, 0x84, 0x0b,
	0x9b, 0xb2, 0xc7, 0x8b, 0x2a, 0x76, 0x9a, 0xf8, 0x73, 0xbe, 0x7e, 0x8f, 0xa1, 0xcb, 0xcc, 0x15,
	0x4c, 0xef, 0x90, 0x33, 0x2d, 0xa4, 0x9d, 0x35, 0xdc, 0x8e, 0xa5, 0x04, 0x4b, 0x7b, 0x07, 0xbf,
	0x65, 0xaa, 0xd3, 0xd2, 0xc2, 0x97, 0xb0, 0xd7, 0x56, 0xff, 0xcd, 0xad, 0xb7, 0xce, 0x83, 0xa9,
	0x39, 0xfe, 0xfc, 0x30, 0x2b, 0xc8, 0x96, 0xb9, 0x38, 0xfa, 0xb6, 0x77, 0x72, 0xe9, 0x4d, 0x26,
	0x53, 0x1d, 0x6d, 0xc5, 0x00, 0xdd, 0xf1, 0x52, 0x9e, 0xed, 0x43, 0x0e, 0x03, 0x47, 0x37, 0xd9,
	0xca, 0x61, 0x36, 0x49, 0x7a, 0x10, 0xa7, 0xa2, 0x1b, 0x31, 0xa0, 0x8c, 0xf7, 0x51, 0x16, 0x2f,
	0x1c, 0x2e, 0x6b, 0x54, 0x1e, 0xdf, 0x3b, 0x9f, 0xc1, 0x19, 0xb1, 0xfb, 0x59, 0x57, 0xe2, 0x8d,
	0xa6, 0xd4, 0x02, 0x58, 0xee, 0x91, 0xab, 0x27, 0xa8, 0xde, 0x81, 0x3d, 0x3e, 0xd5, 0xd0, 0x62
};

static const u8 secret_key_table4[] =
{
	0xfb, 0x4e, 0xbd, 0x01, 0x03, 0x37, 0x1c, 0xd9, 0xc3, 0x57, 0xb2, 0x2a, 0xd1, 0xf0, 0x86, 0x30,
	0x3c, 0x5c, 0x85, 0x1a, 0x3a, 0xf5, 0x53, 0x21, 0x8d, 0x38, 0x58, 0xaf, 0x41, 0x2b, 0x94, 0x29,
	0xd2, 0x25, 0xdb, 0x47, 0x78, 0x98, 0xe8, 0xbe, 0xac, 0x8b, 0xc2, 0x67, 0x64, 0x2d, 0xb9, 0x5f,
	0xbf, 0xe0, 0xe5, 0x8e, 0xaa, 0x91, 0x8f, 0x46, 0x6b, 0x8c, 0x13, 0x71, 0x02, 0x84, 0x5d, 0x50,
	0xf3, 0x61, 0xf7, 0x89, 0xae, 0x90, 0xed, 0xa4, 0x7a, 0xb5, 0xf6, 0xdf, 0x96, 0x18, 0xa5, 0x7c,
	0xb1, 0x34, 0xb0, 0x7f, 0x2c, 0x87, 0x77, 0x7e, 0x39, 0x07, 0x43, 0x6a, 0xc8, 0xd8, 0x9b, 0x75,
	0x31, 0xfc, 0x6f, 0x12, 0x0c, 0x10, 0xd7, 0x5a, 0x88, 0x69, 0x3d, 0xd4, 0x1e, 0xd6, 0x9d, 0xa3,
	0xfe, 0x0a, 0xd0, 0xb7, 0x80, 0x49, 0x16, 0xca, 0x68, 0xea, 0x24, 0xe9, 0xce, 0x9f, 0x11, 0xbb,
	0x92, 0x83, 0x52, 0x45, 0x27, 0x33, 0xe1, 0xa8, 0x6d, 0x97, 0x5e, 0xcd, 0xc7, 0xab, 0xe2, 0xcc,
	0x4d, 0x28, 0x04, 0x35, 0x55, 0xa2, 0xff, 0x05, 0xec, 0xb6, 0xeb, 0x6c, 0xa0, 0x44, 0xb8, 0x60,
	0x26, 0x95, 0x76, 0xc1, 0xdc, 0x56, 0xfa, 0x23, 0x66, 0x4f, 0x19, 0x1f, 0xda, 0x65, 0x54, 0xdd,
	0xb4, 0xf9, 0x93, 0x4c, 0xee, 0x51, 0x63, 0x72, 0xf2, 0x0f, 0xc6, 0xcf, 0xe4, 0xa6, 0x3b, 0x81,
	0x08, 0xa7, 0xe6, 0x1d, 0xd5, 0x6e, 0x9a, 0x4b, 0xcb, 0xf4, 0x9e, 0xe7, 0xf8, 0xf1, 0xbc, 0xc0,
	0x15, 0x09, 0x22, 0x82, 0x79, 0xa1, 0x74, 0x0e, 0xc9, 0x17, 0x5b, 0x8a, 0x7b, 0x06, 0xc5, 0x3f,
	0x00, 0xa9, 0x14, 0x62, 0x4a, 0xc4, 0xde, 0x48, 0xd3, 0xb3, 0x2e, 0x0b, 0x0d, 0x40, 0x3e, 0xe3,
	0x2f, 0x73, 0x70, 0xef, 0x9c, 0x36, 0x42, 0x32, 0xad, 0x20, 0x99, 0x59, 0x7d, 0xfd, 0xba, 0x1b
};
#endif
/*==========================================================================*/
static void _Delay_5us(void)
{
	u8 i;
   	for (i = 0;i < 10;i++);
}
/*==========================================================================*/
static void _SWI2C_SetBusID(u8 addr)
{
	if (addr == 0xBA || I2C_write_EE)
	{
		IIC_bus_no = 0;
	}
	else
	{
		IIC_bus_no = 1;
	}
}
/*==========================================================================*/
static void _SWI2C_Start(void)
{
	GPIO_WriteHigh(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
	GPIO_WriteHigh(IIC_PORT,IIC_SDA_pin[IIC_bus_no]);
	_Delay_5us();
	GPIO_WriteLow(IIC_PORT,IIC_SDA_pin[IIC_bus_no]);
	_Delay_5us();
	GPIO_WriteLow(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
}
/*==========================================================================*/
static void _SWI2C_Stop(void)
{
	GPIO_WriteLow(IIC_PORT,IIC_SDA_pin[IIC_bus_no]);
	_Delay_5us();
	GPIO_WriteHigh(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
	_Delay_5us();
	GPIO_WriteHigh(IIC_PORT,IIC_SDA_pin[IIC_bus_no]);
}
/*==========================================================================*/
static u8 _SWI2C_SendByte(u8 value)
{
	u8 count;
	
