chengping1970/STM8S207/sw_i2c.c
	GPIO_Init(POWER_ONOFF_PORT, POWER_ONOFF_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	GPIO_Init(POWER_ONOFF_PORT, POWER_ONOFF1_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_WriteHigh(POWER_ONOFF_PORT, POWER_ONOFF_PIN);
	GPIO_WriteHigh(POWER_ONOFF_PORT, POWER_ONOFF1_PIN);
	
	GPIO_Init(FPGA_RESET_PORT, FPGA_RESET_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_Init(IT680X_RESET_PORT, IT680X_RESET_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	
	GPIO_Init(LED_R_PORT, LED_R_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);	
	GPIO_Init(LED_G_PORT, LED_G_PIN, GPIO_MODE_OUT_PP_LOW_FAST);

	GPIO_Init(HDMI0_HOTPLUG_PORT, HDMI0_HOTPLUG_PIN, GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_WriteLow(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	GPIO_Init(HDMI1_HOTPLUG_PORT, HDMI1_HOTPLUG_PIN, GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_WriteLow(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
	
	GPIO_Init(BACKLIGHT_ONOFF_PORT, BACKLIGHT_ONOFF_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	GPIO_Init(BACKLIGHT_ONOFF1_PORT, BACKLIGHT_ONOFF1_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_WriteHigh(BACKLIGHT_ONOFF_PORT, BACKLIGHT_ONOFF_PIN);
	GPIO_WriteHigh(BACKLIGHT_ONOFF1_PORT, BACKLIGHT_ONOFF1_PIN);
	GPIO_Init(BACKLIGHT_PWM_PORT, BACKLIGHT_PWM_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_Init(VPANEL_ONOFF_PORT, VPANEL_ONOFF_PIN, GPIO_MODE_OUT_PP_LOW_FAST);
	
	TIM1_TimeBaseInit(0, TIM1_COUNTERMODE_UP, 4095, 0);
	TIM1_OC1Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_DISABLE,
	           1350, TIM1_OCPOLARITY_LOW, TIM1_OCNPOLARITY_HIGH, TIM1_OCIDLESTATE_SET,
	           TIM1_OCNIDLESTATE_RESET);
	TIM1_Cmd(ENABLE);
	TIM1_CtrlPWMOutputs(ENABLE);
#if MHL_IIC_ERROR_RESET
	I2C_error_count = 0;
#endif
	I2C_write_EE = FALSE;
}
/*==========================================================================*/
void SWI2C_Update(void)
{	
	if (Backlight_on_timer == TIMER_EXPIRED)
	{
		u8 backlight;
		SWI2C_ReadEEPROM(0xA0, BACKLIGHT_POSITION, 1, &backlight);
		SWI2C_SetBacklight(backlight);
		SET_BACKLIGHT_ON();
		Backlight_on_timer = TIMER_STOPPED;
		//SWI2C_ToggleI2CMode();
	}

	if (Power_status && !I2C_stop)
	{
		IT6802_fsm();
		#if CONTROL_FRC_BOARD
		if (frc_update_timer == TIMER_EXPIRED && Have_FRC)
		{
			u8 read_LVDS_mode, read_MFC;
			SWI2C_ReadByte(FRC_BOARD_ADDRESS, 0x18, &read_LVDS_mode);
			if (read_LVDS_mode != LVDS_mode)
			{
				SWI2C_WriteByte(FRC_BOARD_ADDRESS, 0x18, LVDS_mode);
			}
			SWI2C_ReadByte(FRC_BOARD_ADDRESS, 0x0A, &read_MFC);
			if (read_MFC != 0)
			{
				IR_DelayNMiliseconds(50);
				SWI2C_WriteByte(FRC_BOARD_ADDRESS, 0x0A, 0);
			}
			frc_update_timer = FRC_UPDATE_TIME;
		}	
		#endif

		#if WRITE_4K30Hz_PANEL
		if (panel_update_timer == TIMER_EXPIRED)
		{
			uint8_t panel_set_4k[8] = {0x38, 0x50, 0x6D, 0x00, 0x00, 0x00, 0x00, 0x02};
			uint8_t panel_set_8bit[8] = {0x38, 0x64, 0x1C, 0x00, 0x00, 0x00, 0x00, 0x01};
			I2C_write_EE = TRUE;
			SWI2C_WriteBytes(0xE0, 0x26, 8, panel_set_4k);
			SWI2C_WriteBytes(0xE0, 0x26, 8, panel_set_8bit);
			I2C_write_EE = FALSE;
			panel_update_timer = PANEL_UPDATE_TIME;
		}
		#endif

#if FPGA_KEY_VERIFY_AUTO
		if (secret_detect_timer == TIMER_EXPIRED)
		{
			SWI2C_VerifyKey();
			secret_detect_timer = SECRET_DETECT_TIME;
		}
#endif
		if (signal_detect_timer == TIMER_EXPIRED)
		{
			
			u8 current_signal_status;
			
			signal_detect_timer = SINGNAL_TETECT_TIME;
			current_signal_status = SWI2C_GetSignalStatus();
			if (current_signal_status != signal_status)
			{
				singal_change_count++;
				if (current_signal_status && singal_change_count > SIGNAL_STABLE_COUNT)
				{
					signal_status = TRUE;
					GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
					SWI2C_FirstResetFPGA();
					SWI2C_ResetFPGA();
					SET_VPANEL_ON();
					Backlight_on_timer = BACKLIGHT_DELAY_TIME;
					
					
				}
				else if (!current_signal_status && singal_change_count > NO_SIGNAL_COUNT)
				{
					signal_status = FALSE;
					Backlight_on_timer = TIMER_STOPPED;
					SET_BACKLIGHT_OFF();
					IR_DelayNMiliseconds(200);
					SET_VPANEL_OFF();
#if NO_SIGNAL_RESET_FPGA
					GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
#endif
				}
			}
			else
			{
				singal_change_count = 0;
			}			

			if (signal_status)
			{
				GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
			}
			else
			{
				uint8_t Port = IR_GetHDMIPort();
				if (IR_GetHDMIPort5V(Port) == 0 && IR_GetHDMIPort5V(!Port) == 1)
				{
					GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
					IR_SetHDMIPort(!Port);
				}
				else
				{
					GPIO_WriteReverse(LED_G_PORT, LED_G_PIN);
				}
			}
		}	
	}
}
/*==========================================================================*/
extern void storage_init(void);
void SWI2C_SystemPowerUp(void)
{
	SET_POWER_ON();
	GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
	GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
	DEBUG_PRINTF(printf("\r\n==== POWER UP ====\r\n"));
	IR_DelayNMiliseconds(200);
	Power_status = TRUE;
	GPIO_WriteLow(IT680X_RESET_PORT, IT680X_RESET_PIN);
	//GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
	IR_DelayNMiliseconds(200);
	GPIO_WriteHigh(IT680X_RESET_PORT, IT680X_RESET_PIN);
	//GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
	IR_DelayNMiliseconds(200);
	IT6802_fsm_init();
#if CONTROL_FRC_BOARD	 
	Have_FRC = SWI2C_TestDevice(FRC_BOARD_ADDRESS);
#endif
#if !DATA_STORAGE_FLASH
	storage_init();
#endif
	UART_InitMachineNo();
#if ENABLE_HDMI_HPD
	GPIO_WriteHigh(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	GPIO_WriteHigh(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
	IR_DelayNMiliseconds(2000);
	GPIO_WriteLow(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	GPIO_WriteLow(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
#endif
	singal_change_count = 0;
	signal_status = FALSE;
}
/*==========================================================================*/
void SWI2C_ResetFPGA(void)
{
	if (Power_status)
	{		
		GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(200);
		GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(1500);
		FPGA_Init();
#if WRITE_WEAVING_TABLE
		FPGA_WriteWeavingTable();
#endif

	}
}
/*==========================================================================*/
void SWI2C_FirstResetFPGA(void)
{
	if (Power_status)
	{		
#if START_RESET_HDMI
		GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(200);
		GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(500);
		SWI2C_WriteByte(0x90, 0x14, 0xFF);
		IR_DelayNMiliseconds(1000);
		SWI2C_WriteByte(0x90, 0x14, 0x0);
#else
		GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(200);
#endif
	}
}
/*==========================================================================*/
void SWI2C_SystemPowerDown(void)
{
	GPIO_WriteHigh(LED_R_PORT, LED_R_PIN);			
	GPIO_WriteLow(LED_G_PORT, LED_G_PIN);
	SET_BACKLIGHT_OFF();
	IR_DelayNMiliseconds(200);
	GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
	SET_VPANEL_OFF();
	SET_POWER_OFF();
#if ENABLE_HDMI_HPD
	GPIO_WriteHigh(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	GPIO_WriteHigh(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
#endif
	DEBUG_PRINTF(printf("==== POWER DOWN ====\r\n"));
	Backlight_on_timer = TIMER_STOPPED;
	Power_status = FALSE;
	I2C_stop = FALSE;
}
/*==========================================================================*/
void SWI2C_ToggleI2CMode(void)
{
	if (Power_status)
	{
		I2C_stop = !I2C_stop;
		if (I2C_stop)
		{
			GPIO_WriteHigh(LED_R_PORT, LED_R_PIN);			
			GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
		}
		else
		#if DATA_STORAGE_FLASH
		{
			u8 value;
			SWI2C_ReadByte(FPGA_ADDRESS, 0xCF, &value);
			if (value == 0xFF)
			{
				SWI2C_ReadByte(FPGA_ADDRESS, 0xC8, &value);
				FLASH_ProgramByte(EEPROM_START_ADDRESS + 2, value);
				SWI2C_ReadByte(FPGA_ADDRESS, 0xC9, &value);
				FLASH_ProgramByte(EEPROM_START_ADDRESS + 3, value);
				SWI2C_ReadByte(FPGA_ADDRESS, 0xCA, &value);
				FLASH_ProgramByte(EEPROM_START_ADDRESS + 4, value);
				SWI2C_ReadByte(FPGA_ADDRESS, 0xCB, &value);
				FLASH_ProgramByte(EEPROM_START_ADDRESS + 5, value);
				IR_DelayNMiliseconds(200);
				WWDG->CR |= 0x80;
				WWDG->CR &= ~0x40;
			}
			GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
			GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
			}
		#else
		{
			GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
			GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
		}
		#endif
	}
}
/*==========================================================================*/
void SWI2C_ProcessPower(void)
{
	if (Power_status)
	{
		SWI2C_SystemPowerDown();
	}
	else
	{
		SWI2C_SystemPowerUp();
	}
}
/*==========================================================================*/
static void SWI2C_Set3DOnOff(u8 OnOff)
{
#if SUPPORT_4K_PANEL
	u8 reg_value, insert, retry;
	if (OnOff)
	{
		reg_value = 0x80;
		insert = 0;
	}
	else
	{
		reg_value = 0x0;
		insert = 1;
	}
	for (retry = 0; retry < 3; retry++)
	{
		u8 value;
		SWI2C_WriteByte(FPGA_ADDRESS, 0x57, reg_value);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x3A, insert);
		SWI2C_ReadByte(FPGA_ADDRESS, 0x57, &value);
		if (value == reg_value)
		{
			break;
		}
	}
#else
	u8 switch3D, insert, retry;
	

	
	SWI2C_ReadByte(FPGA_ADDRESS, 0x0D, &insert);
	#if SUPPORT_1080P_9VIEW
	if (OnOff)
	{
		switch3D = 0x40;
		insert &= 0xDF;
	}
	else
	{
		switch3D = 0x0;
		insert |= 0x20;
	}
	#else
	if (OnOff)
	{
		switch3D = 0x40;
	}
	else
	{
		switch3D = 0x0;
	}
	insert |= 0x20;
	#endif
	for (retry = 0; retry < 3; retry++)
	{
		u8 value;
		SWI2C_WriteByte(FPGA_ADDRESS, 0x57, switch3D);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x0D, insert);
		SWI2C_ReadByte(FPGA_ADDRESS, 0x57, &value);
		if (value == switch3D)
		{
			break;
		}
	}
#endif
}
/*==========================================================================*/
void SWI2C_Toggle3DOnOff(void)
{	
	Set3DOn = !Set3DOn;
	SWI2C_Set3DOnOff(Set3DOn);
}
/*==========================================================================*/
void SWI2C_ToggleInsert(void)
{	
#if SUPPORT_4K_PANEL
	u8 insert;
	SWI2C_ReadByte(FPGA_ADDRESS, 0x3A, &insert);
	insert = !insert;
	SWI2C_WriteByte(FPGA_ADDRESS, 0x3A, insert);
#else
	u8 insert;
	SWI2C_ReadByte(FPGA_ADDRESS, 0x0D, &insert);
	if (insert&0x20)
	{
		insert &= 0xDF;
	}
	else
	{
		insert |= 0x20;
	}
	SWI2C_WriteByte(FPGA_ADDRESS, 0x0D, insert);
#endif
}
/*==========================================================================*/
extern const u8 address_table[];
extern const u8 table_size;

void FPGA_Init(void)
 {	
#if DATA_STORAGE_FLASH
	u8 i;
	for (i = 0; i < table_size; i++)
	{
		SWI2C_WriteByte(FPGA_ADDRESS, address_table[i], FLASH_ReadByte(EEPROM_START_ADDRESS + 1 + i));
	}
	if (FLASH_ReadByte(EEPROM_START_ADDRESS + 1))
	{
		Set3DOn = TRUE;
	}
#else
	u8 i, val;
	for (i = 0; i < table_size; i++)
	{
		SWI2C_ReadEEPROM(0xA0, i + 1, 1, &val);
		if (i == 0)
		{
			if (val)
			{
				Set3DOn = TRUE;
			}
			else
			{
				Set3DOn = FALSE;
			}
		}
		SWI2C_WriteByte(FPGA_ADDRESS, address_table[i], val);
	}
#endif
	SWI2C_WriteByte(FPGA_ADDRESS, 0x19, 0x04);
#if SUPPORT_4K_PANEL
	#if MIX_3D_AND_2D
	SWI2C_WriteByte(FPGA_ADDRESS, 0xD6, 0x82);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xD7, 0x80);
	#else	
	SWI2C_WriteByte(FPGA_ADDRESS, 0xD6, 0x00);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xD7, 0x00);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE0, 0x11);
	#endif
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE1, 0x32);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE2, 0x54);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE3, 0x76);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE4, 0x07);
#else
	#if SUPPORT_1080P_2DZ_ORI
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE0, 0x11);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE1, 0x32);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE2, 0x54);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE3, 0x7E);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE4, 0x00);
	#else
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE0, 0x11);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE1, 0x32);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE2, 0x54);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE3, 0x76);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE4, 0x07);
	#endif
#endif
	SWI2C_Set3DOnOff(Set3DOn);	
}
/*==========================================================================*/
void HDMI_HotPlug(u8 value)
{
	if (value)
	{
		GPIO_WriteLow(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
		GPIO_WriteLow(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
	}
	else
	{
		GPIO_WriteHigh(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
		GPIO_WriteHigh(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	}
}
/*==========================================================================*/
static const u8 deep_value[6][3] =
{
	//* 0x59 0x5C 0x5A 
	{0x30, 0x80, 0x60},
	{0x50, 0x70, 0x70},
	{0x70, 0x60, 0x80},
	{0x90, 0x50, 0x90},
	{0xA0, 0x40, 0xA0},
	{0xA8, 0x30, 0xA0},
	};
void SWI2C_Set_deep(u8 deep)
{
	if (deep == 0)
	{
#if DATA_STORAGE_FLASH
		SWI2C_WriteByte(FPGA_ADDRESS, 0x59, FLASH_ReadByte(0x4000 + REG_0x59 + 1));
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5C, FLASH_ReadByte(0x4000 + REG_0x5C + 1));
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5A, FLASH_ReadByte(0x4000 + REG_0x5A + 1));
#else
		u8 val;
		SWI2C_ReadEEPROM(0xA0, REG_0x59 + 1, 1, &val);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x59, val);
		SWI2C_ReadEEPROM(0xA0, REG_0x5C + 1, 1, &val);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5C, val);
		SWI2C_ReadEEPROM(0xA0, REG_0x5A + 1, 1, &val);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5A, val);
#endif
	}
	else
	{
		SWI2C_WriteByte(FPGA_ADDRESS, 0x59, deep_value[deep][0]);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5C, deep_value[deep][1]);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5A, deep_value[deep][2]);
	}
}
/*==========================================================================*/
#if MHL_IIC_ERROR_RESET
void SWI2C_ErrorProcess(void)
{
	I2C_error_count++;
	if (I2C_error_count > 50)
	{
		DEBUG_PRINTF(printf("I2C Error, reboot!!!\r\n"));
		IR_DelayNMiliseconds(1000);
		WWDG->CR |= 0x80;
		WWDG->CR &= ~0x40;
	}
}
#endif
/*==========================================================================*/
void SWI2C_SetBacklight(u8 backlight)
{
	u32 temp = (100 - backlight);
	temp = (temp*4095)/100;
	TIM1_OC1Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_DISABLE,
	           temp, TIM1_OCPOLARITY_LOW, TIM1_OCNPOLARITY_HIGH, TIM1_OCIDLESTATE_SET,
	           TIM1_OCNIDLESTATE_RESET);
}
/*==========================================================================*/
void SWI2C_UpdateTimer(void)
{
#if CONTROL_FRC_BOARD
	if (frc_update_timer > TIMER_EXPIRED)
	{
		frc_update_timer--;
	}
#endif	
	if (Backlight_on_timer > TIMER_EXPIRED)
	{
		Backlight_on_timer--;
	}
#if FPGA_KEY_VERIFY_AUTO
	if (secret_detect_timer > TIMER_EXPIRED)
	{
		secret_detect_timer--;
	}	
#endif
	if (signal_detect_timer > TIMER_EXPIRED)
	{
		signal_detect_timer--;
	}	
#if WRITE_4K30Hz_PANEL
	if (panel_update_timer > TIMER_EXPIRED)
	{
		panel_update_timer--;
	}
#endif
}
/*==========================================================================*/

